<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //
        DB::table('posts')->insert([

            [
                'category_id' => '1',
                'post_title' => 'জন্মবীজ',
                'post_slug' => 'জন্মবীজ',
                'post_description' => 'এই ঘরের সাথে এক টুকরো বারান্দা আছে।। বারান্দা থেকে আকাশ দেখা যায়। আকাশ ঘন নীল। সব সময় নীল থাকে না। কখনও কালো হয়ে যায়। কখনও বা লাল। মাঝে মাঝে ঈষৎ নীলাভাস। কলা পাতা যত না সবুজ রঙ পাল্টায় তার চেয়ে বেশি রঙ পাল্টায় নীল আকাশ। রাতের আকাশ নক্ষত্রখচিত। কাল মহাকাল অনন্ত যাত্রাপথ। হাজার হাজার নক্ষত্রের উল্লাস। শব্দহীন। গভীর। নির্জন চরাচর। বায়ুমণ্ডল বহমান। ক্লান্ত স্রোতহীন। জ্যোৎস্নার কত কত রূপ। মরা জ্যোৎস্না। তীব্র জ্যোৎস্না। ক্লান্ত জ্যোৎস্না। মায়াবি জ্যোৎস্না। জ্যোৎস্নায় সাঁতার কেটে কেটে ভরা কাটাল মরা কাটাল পার করে একা চাঁদ। কত কত দিন ভেতরের কান্না গুমরে উঠে গান হয়ে যায়। বারান্দায় কাঠের একটা মাচা করা। মাচার উপর থরে থরে সাজানো টব। পাশেই একটা আরামদায়ক চেয়ার। এই চেয়ারে বসেই এই গল্পের পাঠিকা ভাবছে। এবার কিছু শ্বেতকাঞ্চন আর রক্ত কাঞ্চনের চারা উঠাবে। কুর্চি ফুলের বীজ পড়ে আছে অনেক দিন। সেগুলোও ফুটিয়ে দিতে হবে। অপরাজিতা পাপড়িতে কিছুটা আকাশ ধারণ করে। আকাশের কষ্টের গাঢ় নীল নির্যাস থেকেই নীল অপরাজিতা। তবু ফুল নয়- শুধু ফুল নয় ফলজ বীজের অঙ্কুরউদগমনে জন্মদ মনে হয়। যার কথা বলছি তার সম্পর্কে বেশি কিছু জানি না। অনুমান করতে পারি মাত্র। সে আপনারাও করতে পারবেন। একটা বিষয়ে প্রথমত আপনাদের জানিয়ে রাখি সে নারীর ব্যক্তিত্বে গান্ধারীর আবেদন। চামড়ার নীচে কোনও চর্বি নাই। চোখে কাজল ছাড়া কেউ তাকে দেখেছে এরকম কাউকে চিনি না। চোখদুটো দেখলে পুরনো দিনের কড়ির কথা মনে পড়বেই। শাড়ির আচ্ছাদন ভেদ করে যতটা আভাস পাওয়া যাবে তাতে বাদামী রঙের সঙ্গে সামান্য দুঃখ মেশানো রয়েছে বলে মেনে নিতে হবে। সাদা মেশানো কালো চুলের পাশ দিয়ে দু কানে রূপালি রঙের আভরণ শোভা পায়। এছাড়া বাড়তি কোনও গহনায় আগ্রহ নাই। তবে সেমিনার বা বক্তৃতার সময় রুচির সঙ্গে মিলিয়ে তৈরি হয়ে নেয়। কেবলি মনে হবে দেবী হতে হতে মানবী হয়ে উঠেছে।',
                'author_id' => '4',
                'post_date' => '2022-12-01',
                'headline' => '1',
                'first_section' => '1',
                'status' => '1',
                'author_custom_post_id' => '4',
                'image' => 'public/admin/storage/posts/original/vabnake-vaba-zete-pare.webp',
            ],
          
    
        ]);
    }
}
